garyPenhook/PyAvrOCD/svd/avr64db48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CCL</name>
      <description>Configurable Custom Logic</description>
      <baseAddress>0x008001C0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5</offset>
        <size>0x1B</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL0</name>
          <description>Interrupt Control 0</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTMODE0</name>
              <description>Interrupt Mode for LUT0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE1</name>
              <description>Interrupt Mode for LUT1</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE2</name>
              <description>Interrupt Mode for LUT2</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE3</name>
              <description>Interrupt Mode for LUT3</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL1</name>
          <description>Interrupt Control 1</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTMODE4</name>
              <description>Interrupt Mode for LUT4</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE5</name>
              <description>Interrupt Mode for LUT5</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Flag</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT0CTRLA</name>
          <description>LUT 0 Control A</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>LUT Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>Clock Source Selection</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKPER</name>
                  <description>Peripheral Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>Selection by INSEL2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCHF</name>
                  <description>Internal High-Frequency Oscillator</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC32K</name>
                  <description>32.768 kHz oscillator</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC1K</name>
                  <description>32.768 kHz oscillator divided by 32</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTSEL</name>
              <description>Filter Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCH</name>
                  <description>Synchronizer enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER</name>
                  <description>Filter enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEN</name>
              <description>Output Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGEDET</name>
              <description>Edge Detection Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Edge detector is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Edge detector is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT0CTRLB</name>
          <description>LUT 0 Control B</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INSEL0</name>
              <description>LUT Input 0 Source Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event input source A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event input source B</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN0</name>
                  <description>IO pin LUTn-IN0 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0</name>
                  <description>AC0 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZCD0</name>
                  <description>ZCD0 OUT input source</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>USART0 TXD input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 MOSI input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO0 input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1</name>
                  <description>TCA1 WO0 input source</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0</name>
                  <description>TCB0 WO input source</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0</name>
                  <description>TCD0 WOA input source</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSEL1</name>
              <description>LUT Input 1 Source Selection</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event input source A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event input source B</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN1</name>
                  <description>IO pin LUTn-IN1 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1</name>
                  <description>AC1 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZCD1</name>
                  <description>ZCD1 OUT input source</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>USART1 TXD input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 MOSI input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO1 input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA1</name>
                  <description>TCA1 WO1 input source</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1</name>
                  <description>TCB1 WO input source</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0</name>
                  <description>TCD0 WOB input source</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
