garyPenhook/PyAvrOCD/svd/avr64db48.svd
        <register>
          <name>USERTCB1CAPT</name>
          <description>User 32 - TCB1 Event A</description>
          <addressOffset>0x40</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCB1COUNT</name>
          <description>User 33 - TCB1 Event B</description>
          <addressOffset>0x41</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCB2CAPT</name>
          <description>User 34 - TCB2 Event A</description>
          <addressOffset>0x42</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCB2COUNT</name>
          <description>User 35 - TCB2 Event B</description>
          <addressOffset>0x43</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCB3CAPT</name>
          <description>User 36 - TCB3 Event A</description>
          <addressOffset>0x44</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCB3COUNT</name>
          <description>User 37 - TCB3 Event B</description>
          <addressOffset>0x45</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCD0INPUTA</name>
          <description>User 40 - TCD0 Event A</description>
          <addressOffset>0x48</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
